In [1]:
# Read excel file in pandas
# Syntax
# pd.read_excel(r"file_path/file_name.xlsx") ==> Excel
# pd.read_csv(r"file_path/file_name.csv")  ==> Csv

In [2]:
# path
# extensions ==> .xlsx = excel file  
                 # .csv= csv file
# single / double slash / raw string

# sheet_name : Specifies which sheet in the Excel file to read. By default read first sheet
# header (None/other number) : Define which row to use as the header (column names). # header=None==> all data consider as record
# usecols : Define which columns to read from the Excel sheet.

In [3]:
# skiprows : Skips a specified number of rows at the start ==> int ==> # starting recods removed
#                                                          ==> []  ==> Defined rows removed

In [26]:
 # Load data from file "tResult1"
import pandas as pd

In [27]:
data=pd.read_excel(r"C:\Users\hi\Documents\Desktop\Minskole classes\Pandas\tResult1.xlsx")
data

,Exam No,Student,Sem1,Sem2,Sem3,Sem4,Result,1st Year percentage,2nd Year percentage
0,1,student1,34,40,50,32,Fail,37.0,41.0
1,2,student2,45,22,67,55,Fail,33.5,61.0
2,3,student3,67,32,44,34,Fail,49.5,39.0
3,4,student4,38,42,27,34,Fail,40.0,30.5
4,5,student5,56,50,67,44,Pass,53.0,55.5
5,6,student6,76,67,56,44,Pass,71.5,50.0
6,7,student7,66,44,76,38,Pass,55.0,57.0
7,8,student8,45,27,55,56,Fail,36.0,55.5
8,9,student9,66,44,45,55,Pass,55.0,50.0
9,10,student10,73,55,66,88,Fail,64.0,77.0

In [28]:
# Load "Exam No" & "Result" information from Sheet "S4" (file name =tResult1)
pd.read_excel(r"C:\Users\hi\Documents\Desktop\Minskole classes\Pandas\tResult1.xlsx",
              sheet_name='S4',
              header=0, # denotes on which row the heading is present start from index 0
              usecols=["Exam No","Result"]
             )

   Exam No Result
0        1   Fail
1        2   Fail
2        3   Fail
3        4   Fail
4        5   Pass
5        6   Pass
6        7   Pass
7        8   Fail
8        9   Pass
9       10   Pass

In [29]:
pd.read_excel(r"C:\Users\hi\Documents\Desktop\Minskole classes\Pandas\tResult1.xlsx",
              sheet_name='S3',
              header=4,
              usecols=["Exam No","Student"]
             )

    Exam No    Student
0         1   student1
1         2   student2
2         3   student3
3         4   student4
4         5   student5
5         6   student6
6         7   student7
7         8   student8
8         9   student9
9        10  student10
10       11  student11

In [30]:
pd.read_excel(r"C:\Users\hi\Documents\Desktop\Minskole classes\Pandas\tResult1.xlsx",
              sheet_name='S4',
              skiprows=5
             )

    5   student5  Unnamed: 2  50  67  44  Pass    53  55.5
0   6   student6          76  67  56  44  Pass  71.5  50.0
1   7   student7          66  44  76  38  Pass  55.0  57.0
2   8   student8          45  27  55  56  Fail  36.0  55.5
3   9   student9          66  44  45  55  Pass  55.0  50.0
4  10  student10          73  55  66  88  Pass  64.0  77.0

In [31]:
pd.read_excel(r"C:\Users\hi\Documents\Desktop\Minskole classes\Pandas\tResult1.xlsx",
              sheet_name='S4',
              skiprows=[0,1,3,5,7]
             )

    2   student2  45  22  67  55  Fail  33.5    61
0   4   student4  38  42  27  34  Fail  40.0  30.5
1   6   student6  76  67  56  44  Pass  71.5  50.0
2   8   student8  45  27  55  56  Fail  36.0  55.5
3   9   student9  66  44  45  55  Pass  55.0  50.0
4  10  student10  73  55  66  88  Pass  64.0  77.0

In [32]:
# Load data from "Resultcsv"
# delimiter

In [33]:
# let's view the "first" 5 rows of the data:
# rows you mentioned in Parentheses

In [34]:
data=pd.read_csv(r"C:\Users\hi\Documents\Desktop\Minskole classes\Pandas\Resultcsv.csv")
data

,Exam No,Student,Sem1,Sem2,Sem3,Sem4,Result,1st Year percentage,2nd Year percentage
0,1,student1,34,40,50,32,Fail,37.0,41.0
1,2,student2,45,22,67,55,Fail,33.5,61.0
2,3,student3,67,32,44,34,Fail,49.5,39.0
3,4,student4,38,42,27,34,Fail,40.0,30.5
4,5,student5,56,50,67,44,Pass,53.0,55.5
5,6,student6,76,67,56,44,Pass,71.5,50.0
6,7,student7,66,44,76,38,Pass,55.0,57.0
7,8,student8,45,27,55,56,Fail,36.0,55.5
8,9,student9,66,44,45,55,Pass,55.0,50.0
9,10,student10,73,55,66,88,Pass,64.0,77.0

In [35]:
type(data)

pandas.core.frame.DataFrame

In [36]:
data.head()

,Exam No,Student,Sem1,Sem2,Sem3,Sem4,Result,1st Year percentage,2nd Year percentage
0,1,student1,34,40,50,32,Fail,37.0,41.0
1,2,student2,45,22,67,55,Fail,33.5,61.0
2,3,student3,67,32,44,34,Fail,49.5,39.0
3,4,student4,38,42,27,34,Fail,40.0,30.5
4,5,student5,56,50,67,44,Pass,53.0,55.5

In [37]:
data.tail()

,Exam No,Student,Sem1,Sem2,Sem3,Sem4,Result,1st Year percentage,2nd Year percentage
5,6,student6,76,67,56,44,Pass,71.5,50.0
6,7,student7,66,44,76,38,Pass,55.0,57.0
7,8,student8,45,27,55,56,Fail,36.0,55.5
8,9,student9,66,44,45,55,Pass,55.0,50.0
9,10,student10,73,55,66,88,Pass,64.0,77.0

In [38]:
data.head(3)

,Exam No,Student,Sem1,Sem2,Sem3,Sem4,Result,1st Year percentage,2nd Year percentage
0,1,student1,34,40,50,32,Fail,37.0,41.0
1,2,student2,45,22,67,55,Fail,33.5,61.0
2,3,student3,67,32,44,34,Fail,49.5,39.0

In [39]:
data.tail(3)

,Exam No,Student,Sem1,Sem2,Sem3,Sem4,Result,1st Year percentage,2nd Year percentage
7,8,student8,45,27,55,56,Fail,36.0,55.5
8,9,student9,66,44,45,55,Pass,55.0,50.0
9,10,student10,73,55,66,88,Pass,64.0,77.0

In [40]:
# let's view the 10 "random records"
data.sample(5)

,Exam No,Student,Sem1,Sem2,Sem3,Sem4,Result,1st Year percentage,2nd Year percentage
0,1,student1,34,40,50,32,Fail,37.0,41.0
1,2,student2,45,22,67,55,Fail,33.5,61.0
5,6,student6,76,67,56,44,Pass,71.5,50.0
4,5,student5,56,50,67,44,Pass,53.0,55.5
8,9,student9,66,44,45,55,Pass,55.0,50.0

In [41]:
# shape: Returns dimension of the DataFrame in tuple format (rows, columns).
# Used to check the number of rows and columns in the data
data.shape

(10, 9)

In [42]:
# dimension
data.ndim

2

In [43]:
# dtypes: Returns the data types of each column in the DataFrame.
data.dtypes

Exam No                  int64
Student                 object
Sem1                     int64
Sem2                     int64
Sem3                     int64
Sem4                     int64
Result                  object
1st Year percentage    float64
2nd Year percentage    float64
dtype: object

In [44]:
# info(): Provides summary of the DataFrame, including data types and non-null values.
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 9 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Exam No              10 non-null     int64
 1   Student              10 non-null     object
 2   Sem1                 10 non-null     int64
 3   Sem2                 10 non-null     int64
 4   Sem3                 10 non-null     int64
 5   Sem4                 10 non-null     int64
 6   Result               10 non-null     object
 7   1st Year percentage  10 non-null     float64
 8   2nd Year percentage  10 non-null     float64
dtypes: float64(2), int64(5), object(2)
memory usage: 852.0+ bytes